Reports/CRM_ОтчетПоУпущенным.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>CRM_ОтчетПоУпущенным</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокДоступныхТиповГруппировки</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаДиаграммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасшифровка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДиаграммы1</Name>
					<Type>
						<v8:Type>v8ui:ChartType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДиаграмму</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДиаграмма</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеПоляОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРесурсыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительноеПоле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиДиаграммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/CRM_УпущенныйТрафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_УпущенныйТрафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныУпущенныхКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторКомментария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУпущения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыУпущенияТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скрыт</Name>
					<Comment>Блинков для однозначного определения Скрытого трафика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗначенияРеквизитовТрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗначенияРеквизитовТрафика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_РеквизитыТрафика</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитТрафика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_ТипыУпущенияТрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ТипыУпущенияТрафика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/CRM_ОтчетПоУпущенным/Ext/ObjectModule.bsl
Функция УбратьЗапрещенныеСимволы(выбСтрока)
	// функция замещает запрещенные символы на _ в строке
	
	РазрешенныеСимволы = "ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮQWERTYUIOPASDFGHJKLZXCVBNM1234567890_";
	
	рСТрока = "";
	Для сч=1 по СтрДлина(выбСтрока) Цикл
		нСимвол = Сред(СокрЛП(выбСтрока),сч,1);
		Если Найти(РазрешенныеСимволы,ВРег(нСимвол))=0 Тогда
			рСтрока = рСтрока+"_";
		Иначе
			рСтрока = рСтрока+нСимвол;
		КонецЕсли;			
	КонецЦикла;
	
	Возврат рСтрока;
КонецФункции

Процедура ЗаполнитьНастройкиОтчета(НастройкиОтчета, ЭтоДиаграмма=Ложь) Экспорт
	
	СписокРесурсов = Новый СписокЗначений;
	СписокПолей = Новый СписокЗначений;
	
	Для Каждого текСтрока Из ДоступныеПоляОтчета Цикл
		Если текСтрока.Пометка=Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если текСтрока.Ресурс Тогда
			Элемент = СписокРесурсов.Добавить(текСтрока.ИмяПоля);
			Элемент.Пометка = текСтрока.Пометка;
		Иначе
			Элемент = СписокПолей.Добавить(текСтрока.ИмяПоля);
			Элемент.Пометка = текСтрока.Пометка;
		КОнецЕсли;
	КонецЦикла;
	
	// добавим выбранные группировки                    
	Для Каждого текРесурс Из СписокРесурсов Цикл
		Если НайтиПолеКомпоновки(текРесурс.Значение, НастройкиОтчета.Выбор.Элементы) ИЛИ НЕ текРесурс.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
 		ПолеРесурса = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеРесурса.Использование = Истина;
		ПолеРесурса.Заголовок = текРесурс.Значение;
		ПолеРесурса.Поле = Новый ПолеКомпоновкиДанных(текРесурс.Значение);
	КонецЦикла;
	
	////////////
	НастройкиОтчета.Выбор.Элементы.Очистить();
	
	Для Каждого ПолеОтчета Из ДоступныеРесурсыОтчета Цикл
		Если ПолеОтчета.Пометка Тогда
			ПолеРесурса = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеРесурса.Использование = Истина;
			ПолеРесурса.Заголовок = ПолеОтчета.Представление;
			ПолеРесурса.Поле = Новый ПолеКомпоновкиДанных(ПолеОтчета.ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
    НастройкиОтчета.Структура.Очистить();
    
    НастройкиОтчета.УсловноеОформление.Элементы[0].Оформление.Элементы.Найти("Формат").Значение = "ЧДЦ=2";
    
    Если ЭтоДиаграмма Тогда
		
		ПолеДиаграммы = НастройкиОтчета.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеДиаграммы.Использование = Истина;
    	ПолеДиаграммы.Заголовок = ГруппировкаДиаграммы;
    	ПолеДиаграммы.Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);
		
		Если ТипДиаграммы1 = ТипДиаграммы.КруговаяОбъемная Тогда
			
			Для Каждого Показатель Из ПоказателиДиаграммы Цикл
				
				Если Показатель.Пометка Тогда
					
					График = НастройкиОтчета.Структура.Добавить(Тип("ДиаграммаКомпоновкиДанных"));
			    	График.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы", ТипДиаграммы1);
					График.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", Показатель.Представление);
					График.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы.ВидПодписей", ВидПодписейКДиаграмме.Серия);
					График.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы.РасположениеРесурсов", РасположениеРесурсовВДиаграммеКомпоновкиДанных.Серии);
					АвтополеГрафик = График.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")); 
					АвтополеГрафик.Поле = Новый ПолеКомпоновкиДанных(Показатель.ИмяПоля); 
					АвтополеГрафик.Использование = Истина;
			    	
					Серии = График.Серии.Добавить();
					Серии.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);
					Автополе = Серии.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
					АвтоПоле.Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы); 
					Автополе.Использование = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			График = НастройкиОтчета.Структура.Добавить(Тип("ДиаграммаКомпоновкиДанных"));
			График.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы",ТипДиаграммы1);
			График.ПараметрыВывода.УстановитьЗначениеПараметра("ТипДиаграммы.РасположениеРесурсов", РасположениеРесурсовВДиаграммеКомпоновкиДанных.Серии);
			Серии = График.Серии.Добавить();
			Серии.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);
			АвтоПоле = Серии.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			АвтоПоле.Поле = Новый ПолеКомпоновкиДанных(ГруппировкаДиаграммы);
			АвтоПоле.Использование = Истина;
			
			Для Каждого Показатель Из ПоказателиДиаграммы Цикл
				
				Если Показатель.Пометка Тогда
					
					АвтополеГрафик = График.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")); 
					АвтополеГрафик.Поле = Новый ПолеКомпоновкиДанных(Показатель.ИмяПоля); 
					АвтополеГрафик.Использование = Истина;
				
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
    Иначе
 	   ЭлементСтруктуры = НастройкиОтчета;
    	Для Каждого Группировка Из Группировки Цикл
    		// если не указан тип группировки, то установим тип "Элементы"
    		Если ПустаяСтрока(Группировка.ТипГруппировки) Тогда
    			Группировка.ТипГруппировки = "Элементы";
    		КонецЕсли;
    		
    		ЭлементСтруктуры = ВложитьГруппировку(ЭлементСтруктуры, Группировка);
    		
		КонецЦикла;
		
    КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСхемуКомпоновкиДанных() Экспорт
	// изменим текст запроса
	Для Каждого нДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		Если типЗнч(нДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			// меняем только первый набор-запрос
			нДанных.АвтоЗаполнениеДоступныхПолей = Истина;
			
			ВспомогательныйТекст =  "ВЫБРАТЬ
									|	CRM_УпущенныйТрафик.Менеджер,
									|	CRM_УпущенныйТрафик.ДилерскийЦентр,
									|	CRM_УпущенныйТрафик.Причина КАК Причина,
									|	CRM_УпущенныйТрафик.ИдентификаторТрафика,
									|	1 КАК КоличествоУпущено,
									|	ВЫБОР КОГДА (CRM_УпущенныйТрафик.ВидУпущения = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыУпущенияТрафика.Администратор)) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК КоличествоУпущеноАдминистратор,
									|	ВЫБОР КОГДА (CRM_УпущенныйТрафик.ВидУпущения = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыУпущенияТрафика.Менеджер)) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК КоличествоУпущеноМенеджер
									|ПОМЕСТИТЬ УпущенныйТрафик
									|ИЗ
									|	РегистрСведений.CRM_УпущенныйТрафик КАК CRM_УпущенныйТрафик
									|ГДЕ
									|	CRM_УпущенныйТрафик.Период МЕЖДУ &НачалоПериода И &КонецПериода
									|;
                                    |
									|////////////////////////////////////////////////////////////////////////////////
									|ВЫБРАТЬ
									|	Renault_Трафик.Менеджер,
									|	Renault_Трафик.ДилерскийЦентр,
									|	Renault_Трафик.Идентификатор,
									|	Renault_Трафик.ТипТрафика,
									|	Renault_Трафик.Клиент,
									|	Renault_Трафик.Отдел,
									|	Renault_Трафик.Обработан,
									|	Renault_Трафик.ПервичныйПовторный,
									|	ЗНАЧЕНИЕ(Справочник.CRM_ПричиныУпущенныхКлиентов.ПустаяСсылка) КАК Причина,
									|	1 КАК Количество
									|ПОМЕСТИТЬ ПолныйТрафик
									|ИЗ
									|	РегистрСведений.Renault_Трафик КАК Renault_Трафик
									|ГДЕ
									|Renault_Трафик.Период МЕЖДУ &НачалоПериода И &КонецПериода
									|;
									|
									|///////////////////////////////////////////////////////////////////////////////
									//|ВЫБРАТЬ
									//|	РабочиеЛисты.Сотрудник,
									//|	РабочиеЛисты.Клиент,
									//|	1 КАК Количество
									//|ПОМЕСТИТЬ РабочиеЛисты
									//|ИЗ РегистрСведений.Renault_РабочиеЛисты КАК РабочиеЛисты
									//|ГДЕ
									//|РабочиеЛисты.ДатаID МЕЖДУ &НачалоПериода И &КонецПериода
									//|И РабочиеЛисты.ПричинаЗакрытия <> ЗНАЧЕНИЕ(Справочник.CRM_ПричиныЗакрытияРЛ.УспешнаяПродажа)
									//|И РабочиеЛисты.ЛистЗакрыт = ИСТИНА
									//|;
									//|
									//|////////////////////////////////////////////////////////////////////////////////
									|";
			ТекстЗапроса = "
			|ИЗ
			|ПолныйТрафик КАК ПолныйТрафик
			|	ЛЕВОЕ СОЕДИНЕНИЕ УпущенныйТрафик КАК УпущенныйТрафик
			|	ПО ПолныйТрафик.Идентификатор = УпущенныйТрафик.ИдентификаторТрафика
			//|	ЛЕВОЕ СОЕДИНЕНИЕ РабочиеЛисты КАК РабочиеЛисты
			//|	ПО ПолныйТрафик.Менеджер = РабочиеЛисты.Сотрудник
			//|	И ПолныйТрафик.Клиент = РабочиеЛисты.Клиент
			|";
			
			ТекстДоп = "
			|ОБЪЕДИНИТЬ ВСЕ
			|	РабочиеЛисты.Сотрудник,
			|
			|
			|
			|";
			
			ТекстВыбрать = "ВЫБРАТЬ
							|	ПолныйТрафик.Менеджер КАК Менеджер,
							|	ПолныйТрафик.ДилерскийЦентр КАК ДилерскийЦентр,
							|	ПолныйТрафик.ТипТрафика КАК ТипТрафика,
							|	ПолныйТрафик.Отдел КАК Отдел,
							|	ПолныйТрафик.Обработан КАК Обработан,
							|	ПолныйТрафик.ПервичныйПовторный КАК ПервичныйПовторный,
							|	ЕСТЬNULL(УпущенныйТрафик.Причина, ЗНАЧЕНИЕ(Справочник.CRM_ПричиныУпущенныхКлиентов.ПустаяСсылка)) КАК Причина,
							|	СУММА(ЕСТЬNULL(ПолныйТрафик.Количество, 0)) КАК ПервичныйТрафик,
							|	СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущено, 0)+ЕСТЬNULL(РабочиеЛисты.Количество, 0)) КАК ВсеУпущенныеКлиенты,
							|	СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущено, 0)+ЕСТЬNULL(РабочиеЛисты.Количество, 0))/СУММА(ЕСТЬNULL(ПолныйТрафик.Количество, 0)) * 100 КАК ВсеУпущенныеКлиентыПроцент,
							|	СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущеноАдминистратор, 0)) КАК УпущенныеКлиентыРесепшн,
							|	СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущеноАдминистратор, 0))/СУММА(ЕСТЬNULL(ПолныйТрафик.Количество, 0)) * 100 КАК УпущенныеКлиентыРесепшнПроцент,
							|	СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущеноМенеджер, 0)) КАК УпущенныеКлиентыМенеджер,
							|	СУММА(ЕСТЬNULL(УпущенныйТрафик.КоличествоУпущеноМенеджер, 0))/СУММА(ЕСТЬNULL(ПолныйТрафик.Количество, 0)) * 100 КАК УпущенныеКлиентыМенеджерПроцент,
							//|	СУММА(ЕСТЬNULL(РабочиеЛисты.Количество, 0)) КАК ЗакрытыеРЛНеПоПричинеПродажи
							|";
			
			ТекстВыбратьИтог = "
			|
			|;
			|
			|ВЫБРАТЬ
			|	Результат.Менеджер КАК Менеджер,
			|	Результат.ДилерскийЦентр КАК ДилерскийЦентр,
			|	Результат.ТипТрафика КАК ТипТрафика,
			|	Результат.Отдел КАК Отдел,
			|	Результат.Обработан КАК Обработан,
			|	Результат.ПервичныйПовторный КАК ПервичныйПовторный,
			|	Результат.Причина,
			|	СУММА(Результат.ПервичныйТрафик) КАК ПервичныйТрафик,
			|	СУММА(Результат.ВсеУпущенныеКлиенты) КАК ВсеУпущенныеКлиенты,
			|	СУММА(Результат.ВсеУпущенныеКлиентыПроцент) КАК ВсеУпущенныеКлиентыПроцент,
			|	СУММА(Результат.УпущенныеКлиентыРесепшн) КАК УпущенныеКлиентыРесепшн,
			|	СУММА(Результат.УпущенныеКлиентыРесепшнПроцент) КАК УпущенныеКлиентыРесепшнПроцент,
			|	СУММА(Результат.УпущенныеКлиентыМенеджер) КАК УпущенныеКлиентыМенеджер,
			|	СУММА(Результат.УпущенныеКлиентыМенеджерПроцент) КАК УпущенныеКлиентыМенеджерПроцент,
			|	СУММА(Результат.ЗакрытыеРЛНеПоПричинеПродажи) КАК ЗакрытыеРЛНеПоПричинеПродажи";
			
			ТекстГруппировка = "
			|СГРУППИРОВАТЬ ПО
			|	ПолныйТрафик.Менеджер,
			|	ПолныйТрафик.ДилерскийЦентр,
			|	ПолныйТрафик.ТипТрафика,
			|	ПолныйТрафик.Отдел,
			|	ПолныйТрафик.Обработан,
			|	ПолныйТрафик.ПервичныйПовторный,
			|ЕСТЬNULL(УпущенныйТрафик.Причина, ЗНАЧЕНИЕ(Справочник.CRM_ПричиныУпущенныхКлиентов.ПустаяСсылка))";
			
			ТекстГруппировкаИтог = "
			|ИЗ Результат КАК Результат
			|СГРУППИРОВАТЬ ПО
			|	Результат.Менеджер,
			|	Результат.ДилерскийЦентр,
			|	Результат.ТипТрафика,
			|	Результат.Отдел,
			|	Результат.Обработан,
			|	Результат.ПервичныйПовторный,
			|	Результат.Причина
			|";
			
			Для Каждого текСтрока Из ДоступныеПоляОтчета Цикл
				Если ТекСтрока.Пометка=Ложь ИЛИ ТекСтрока.ДополнительноеПоле.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяРеквизита = УбратьЗапрещенныеСимволы(ТекСтрока.ДополнительноеПоле.Наименование);
				
				ТекстЗапроса = ТекстЗапроса + "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика,
				|	CRM_ЗначенияРеквизитовТрафика.ЗначениеРеквизита
				|ИЗ
				|	РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика
				|ГДЕ
				|	CRM_ЗначенияРеквизитовТрафика.РеквизитТрафика.Код = "+Символ(34)+ТекСтрока.ДополнительноеПоле.Код+Символ(34)+") КАК "+ИмяРеквизита+"_Выборка
				|ПО "+ИмяРеквизита+"_Выборка.ИдентификаторТрафика=ПолныйТрафик.Идентификатор
				|";
				
				ТекстВыбрать = ТекстВыбрать+","+ИмяРеквизита+"_Выборка.ЗначениеРеквизита КАК "+ИмяРеквизита;
				ТекстГруппировка = ТекстГруппировка+","+ИмяРеквизита+"_Выборка.ЗначениеРеквизита";
				ТекстВыбратьИтог = ТекстВыбратьИтог+",Результат."+ИмяРеквизита;
				ТекстГруппировкаИтог = ТекстГруппировкаИтог+",Результат."+ИмяРеквизита;
				
			КонецЦикла;
			
			ТекстВыбрать = ТекстВыбрать + "
			|ПОМЕСТИТЬ Результат";
			
			Для Каждого текСтрока Из ДоступныеРесурсыОтчета Цикл
				Если ТекСтрока.Пометка=Ложь ИЛИ ТекСтрока.ДополнительноеПоле.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяРеквизита = УбратьЗапрещенныеСимволы(ТекСтрока.ДополнительноеПоле.Наименование);
				
				ТекстЗапроса = ТекстЗапроса + "ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика,
				|	CRM_ЗначенияРеквизитовТрафика.ЗначениеРеквизита
				|ИЗ
				|	РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика
				|ГДЕ
				|	CRM_ЗначенияРеквизитовТрафика.РеквизитТрафика.Код = "+Символ(34)+ТекСтрока.ДополнительноеПоле.Код+Символ(34)+") КАК "+ИмяРеквизита+"_Выборка
				|ПО "+ИмяРеквизита+"_Выборка.ИдентификаторТрафика=ПолныйТрафик.Идентификатор
				|";
				
				ТекстВыбрать = ТекстВыбрать+","+ИмяРеквизита+"_Выборка.ЗначениеРеквизита КАК "+ИмяРеквизита;
				ТекстГруппировка = ТекстГруппировка+","+ИмяРеквизита+"_Выборка.ЗначениеРеквизита";
				ТекстВыбратьИтог = ТекстВыбратьИтог+",Результат."+ИмяРеквизита;
				ТекстГруппировкаИтог = ТекстГруппировкаИтог+",Результат."+ИмяРеквизита;
				
			КонецЦикла;
			
			нДанных.Запрос = ВспомогательныйТекст+ТекстВыбрать+ТекстЗапроса+ТекстГруппировка+
			ТекстВыбратьИтог+ТекстГруппировкаИтог;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не Renault_РаботаСПравамиПользователя.ЕстьПравоОткрытияОтчетапродаж(ПараметрыСеанса.Пользователь,"CRM_ОтчетПоУпущенным") тогда
		Сообщить("Недостаточно прав доступа.");
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
	// переработаем СКД на базе выбранных настроек
	//СформироватьСхемуКомпоновкиДанных();
	//
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//
	ЗаполнитьНастройкиОтчета(НастройкиОтчета);

	//    Далее, устанавливаем значения параметров и загружаем заполненные настройки
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Период);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// диаграмма
	РезультатДиаграмма.Очистить();
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ЗаполнитьНастройкиОтчета(НастройкиОтчета, Истина);
	
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Период);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(РезультатДиаграмма);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Функция НайтиПолеКомпоновки(Имя, Коллекция) Экспорт
	Для Каждого ПолеКомпоновкиДанных Из Коллекция Цикл
		Если ПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(Имя) Тогда
			Возврат Истина;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;
КонецФункции

Функция ВложитьГруппировку(ЭлементСтруктуры, Группировка)
	
	ЭлементСтруктуры = ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ЭлементГруппировки = ЭлементСтруктуры.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ЭлементГруппировки.Использование = Истина;
	ЭлементГруппировки.Поле =  Новый ПолеКомпоновкиДанных(Группировка.Поле);                                                  
	ЭлементГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных[Группировка.ТипГруппировки];
	
	ПолеСортировки = ЭлементСтруктуры.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	ПолеСортировки.Использование = Истина;

	
	ЭлементВыбора = ЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));//.Поле = Новый ПолеКомпоновкиДанных(Элемент.ИмяПоля);
	ЭлементВыбора.Использование = Истина;
	Возврат ЭлементСтруктуры;
	
КонецФункции
